xdu-aero-association/FM33LC0XX_Example_0.04/RTC 时标输出/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_uart.h
/**
  * @brief    
  * @rmtoll   ISR    PERR    LL_UART_IsActiveFlag_PERR
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_UART_IsActiveFlag_PERR(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->ISR, UART_ISR_PERR_Msk) == (UART_ISR_PERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    PERR    LL_UART_ClearFlag_PERR
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void LL_UART_ClearFlag_PERR(UART_Type* UARTx)
{
    WRITE_REG(UARTx->ISR, UART_ISR_PERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    FERR    LL_UART_IsActiveFlag_FERR
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_UART_IsActiveFlag_FERR(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->ISR, UART_ISR_FERR_Msk) == (UART_ISR_FERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    FERR    LL_UART_ClearFlag_FERR
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void LL_UART_ClearFlag_FERR(UART_Type* UARTx)
{
    WRITE_REG(UARTx->ISR, UART_ISR_FERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    RXERR    LL_UART_IsActiveFlag_RXERR
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_UART_IsActiveFlag_RXERR(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->ISR, UART_ISR_RXERR_Msk) == (UART_ISR_RXERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    RXERR    LL_UART_ClearFlag_RXERR
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void LL_UART_ClearFlag_RXERR(UART_Type* UARTx)
{
    WRITE_REG(UARTx->ISR, UART_ISR_RXERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    RXTO    LL_UART_IsActiveFlag_RXTO
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_UART_IsActiveFlag_RXTO(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->ISR, UART_ISR_RXTO_Msk) == (UART_ISR_RXTO_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    RXTO    LL_UART_ClearFlag_RXTO
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void LL_UART_ClearFlag_RXTO(UART_Type* UARTx)
{
    WRITE_REG(UARTx->ISR, UART_ISR_RXTO_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    RXBF    LL_UART_IsActiveFlag_RXBF
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_UART_IsActiveFlag_RXBF(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->ISR, UART_ISR_RXBF_Msk) == (UART_ISR_RXBF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    RXBF    LL_UART_ClearFlag_RXBF
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void LL_UART_ClearFlag_RXBF(UART_Type* UARTx)
{
    WRITE_REG(UARTx->ISR, UART_ISR_RXBF_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    NEWUP    LL_UART_IsActiveFlag_NEWUP
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_UART_IsActiveFlag_NEWUP(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->ISR, UART_ISR_NEWUP_Msk) == (UART_ISR_NEWUP_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    NEWUP    LL_UART_ClearFlag_NEWUP
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void LL_UART_ClearFlag_NEWUP(UART_Type* UARTx)
{
    WRITE_REG(UARTx->ISR, UART_ISR_NEWUP_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    TXBE    LL_UART_IsActiveFlag_TXBE
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_UART_IsActiveFlag_TXBE(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->ISR, UART_ISR_TXBE_Msk) == (UART_ISR_TXBE_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    TXSE    LL_UART_IsActiveFlag_TXSE
  * @param    UARTx UART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_UART_IsActiveFlag_TXSE(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->ISR, UART_ISR_TXSE_Msk) == (UART_ISR_TXSE_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    TXSE    LL_UART_ClearFlag_TXSE
  * @param    UARTx UART instance
  * @retval   None
  */
__STATIC_INLINE void LL_UART_ClearFlag_TXSE(UART_Type* UARTx)
{
    WRITE_REG(UARTx->ISR, UART_ISR_TXSE_Msk);
}

/**
  * @brief    
  * @rmtoll   TODR    TXDLY_LEN    LL_UART_SetTxTimeDelay
  * @param    UARTx UART instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void LL_UART_SetTxTimeDelay(UART_Type* UARTx, uint32_t time)
{
    MODIFY_REG(UARTx->TODR, (0xffU << 8U), (time << 8U));
}

/**
  * @brief    
  * @rmtoll   TODR    TXDLY_LEN    LL_UART_GetTxTimeDelay
  * @param    UARTx UART instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_UART_GetTxTimeDelay(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->TODR, 0xffU) >> 8U);
}

/**
  * @brief    
  * @rmtoll   TODR    RXDLY_LEN    LL_UART_SetRxTimeOut
  * @param    UARTx UART instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void LL_UART_SetRxTimeOut(UART_Type* UARTx, uint32_t time)
{
    MODIFY_REG(UARTx->TODR, (0xffU << 0U), (time << 0U));
}

/**
  * @brief    
  * @rmtoll   TODR    RXDLY_LEN    LL_UART_GetRxTimeOut
  * @param    UARTx UART instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_UART_GetRxTimeOut(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->TODR, 0xffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   RXBUF        LL_UART_ReceiveData
  * @param    UARTx UART instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_UART_ReceiveData(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->RXBUF, 0x1ffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   TXBUF        LL_UART_TransmitData
  * @param    UARTx UART instance
  * @param    Data 
  * @retval   None
  */
__STATIC_INLINE void LL_UART_TransmitData(UART_Type* UARTx, uint32_t Data)
{
    MODIFY_REG(UARTx->TXBUF, (0x1ffU << 0U), (Data << 0U));
}

/**
  * @brief    
  * @rmtoll   BGR        LL_UART_SetBaudRate
  * @param    UARTx UART instance
  * @param    BaudRate 
  * @retval   None
  */
__STATIC_INLINE void LL_UART_SetBaudRate(UART_Type* UARTx, uint32_t BaudRate)
{
    MODIFY_REG(UARTx->BGR, (0xffffU << 0U), (BaudRate << 0U));
}

/**
  * @brief    
  * @rmtoll   BGR        LL_UART_GetBaudRate
  * @param    UARTx UART instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_UART_GetBaudRate(UART_Type* UARTx)
{
    return (uint32_t)(READ_BIT(UARTx->BGR, 0xffffU) >> 0U);
}

/**
  * @}
  */

/** @defgroup UART_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_UART_DeInit(UART_Type *UARTx);
void LL_UART_StructInit(LL_UART_InitTypeDef *UART_InitStruct);
ErrorStatus LL_UART_Init(UART_Type *UARTx, LL_UART_InitTypeDef *UART_InitStruct);
void LL_UART_InfraRed_StructInit(LL_UART_InfraRed_InitTypeDef *InfraRed_InitStruct);
ErrorStatus LL_UART_InfraRed_Init(UART_Type *UARTx, LL_UART_InfraRed_InitTypeDef *InfraRed_InitStruct);
/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_UART_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-09-19**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
